МойДипломРабочаяВерсия/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

МойДипломРабочаяВерсия/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

МойДипломРабочаяВерсия/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МойДипломРабочаяВерсия/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаАбонентскогоОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияАбонентскогоОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

МойДипломРабочаяВерсия/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
//// Создание актов 

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ИДЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";   
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Период", Объект.Период);
		
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект), ПараметрыОжидания);
	
	  
	
КонецПроцедуры       

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

 
#Область СлужебныеПроцедурыИФункции  
 
&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Запуск длительной операции";
	ВыполняемыйМетод = "ВКМ_ЗаполнениеДокументов.ЗаполнитьДокументы";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
		
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
    		
	Если Результат.Статус = "Выполнено" Тогда 
		ТекстСообщения = "Акты успешно созданы " + ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЗаполнитьНаСервере();    
	ИначеЕсли Результат.Статус = Неопределено Тогда
		ПоказатьПредупреждение(, "Операция не выполнена (нет результата)");
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, "Ошибка при создании актов");
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьНаСервере() 
	
	Объект.Договоры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ДоговорыКонтрагентов.Ссылка,
	|   ДоговорыКонтрагентов.Наименование,
	|   ДоговорыКонтрагентов.Организация,
	|   ДоговорыКонтрагентов.Владелец
	|ИЗ
	|   Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|   НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|   И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|   И ДоговорыКонтрагентов.ВКМ_ДатаНачалаАбонентскогоОбслуживания <= &ДатаНачала";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);  
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период));
	
	ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	
	МассивДоговоров = Новый Массив;
	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		МассивДоговоров.Добавить(СтрокаДоговора.Наименование);
	КонецЦикла;
	
	ЗапросРеализаций = Новый Запрос;
	ЗапросРеализаций.Текст = 
	"ВЫБРАТЬ
	|   РеализацияТоваровУслуг.Договор.Наименование КАК НаименованиеДоговора,
	|   РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|   РеализацияТоваровУслуг.Комментарий КАК Комментарий
	|ИЗ
	|   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|   РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|   И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|   И РеализацияТоваровУслуг.Договор.Наименование В (&МассивДоговоров)
	|   И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	
	ЗапросРеализаций.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	ЗапросРеализаций.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период));
	ЗапросРеализаций.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Период));
	ЗапросРеализаций.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	РеализацииДоговоров = Новый Соответствие;
	ТаблицаРеализаций = ЗапросРеализаций.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРеализации Из ТаблицаРеализаций Цикл
		РеализацииДоговоров[СтрокаРеализации.НаименованиеДоговора] = Новый Структура("Ссылка,Комментарий", 
		СтрокаРеализации.Ссылка, 
		СтрокаРеализации.Комментарий);
	КонецЦикла;
	
	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = СтрокаДоговора.Ссылка;
		
		Если РеализацииДоговоров.Получить(СтрокаДоговора.Наименование) <> Неопределено Тогда 
			ДанныеРеализации = РеализацииДоговоров[СтрокаДоговора.Наименование];
			НоваяСтрока.Реализация = ДанныеРеализации.Ссылка;
			НоваяСтрока.Комментарий = ДанныеРеализации.Комментарий;
		Иначе
			НоваяСтрока.Реализация = "";
			НоваяСтрока.Комментарий = "Реализация отсутствует";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
